Update ARCHITECTURE.md
Replacing plantuml with mermaid
